import 'package:places/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: 'Храм на Крови',
    lat: 56.844376,
    lon: 60.609048,
    url: 'http://www.xram-na-krovi.ru',
    details: '''
      Храм был построен на том месте, где до середины семидесятых
     стоял дом инженера Ипатьева, выбранный в 1918 году в качестве последнего 
     места заключения бывшего императора Николая II и его семьи.''',
    type: 'Храм',
  ),
  Sight(
    name: 'Памятник клавиатуре',
    lat: 56.832409,
    lon: 60.607549,
    url: 'https://ru.wikipedia.org/wiki/Памятник_клавиатуре',
    details: '''
      Представляет собой точную копию компьютерной клавиатуры.
       104 гигантские бетонные клавиши весят от 100 до 500 кг каждая.
       Расположен на втором ярусе набережной р. Исеть, Екатеринбург.''',
    type: 'Арт-объект',
  ),
  Sight(
    name: 'Памятник Владимиру Высоцкому и Марине Влади',
    lat: 56.8371722,
    lon: 60.6158139,
    url:
        'https://ru.wikipedia.org/wiki/Памятник_Владимиру_Высоцкому_и_Марине_Влади',
    details: '''
      Представляет собой точную копию компьютерной клавиатуры.
       104 гигантские бетонные клавиши весят от 100 до 500 кг каждая.
       Расположен на втором ярусе набережной р. Исеть, Екатеринбург.''',
    type: 'Памятник',
  ),
];
